{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileAppConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.iosMobileAppConfiguration",
  "@odata.id": "deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')",
  "@odata.editLink": "deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration",
  "id": "2024a8a3-0d66-4575-a855-4be8d1304db8",
  "targetedMobileApps@odata.type": "#Collection(String)",
  "targetedMobileApps": [
    "ee3a6e08-4cb0-418b-9eb8-43f1a8f1e9de"
  ],
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-24T11:37:11.8148787Z",
  "description": "To differentiate between devices that are managed and unmanaged, a configuration key is required, this ensures that devices receive the correct app protection policy, as unmanaged devices may have stricter controls.\n\nThis policy sets the required configuration key for MDM managed devices, ensuring they receive the managed app protection policy.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T20:50:55.3926541Z",
  "displayName": "iOS - Unsupervised - Edge - IntuneMAMUPN",
  "version": 2,
  "encodedSettingXml": null,
  "settings@odata.type": "#Collection(microsoft.graph.appConfigurationSettingItem)",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.appConfigurationSettingItem",
      "appConfigKey": "IntuneMAMUPN",
      "appConfigKeyType@odata.type": "#microsoft.graph.mdmAppConfigKeyType",
      "appConfigKeyType": "stringType",
      "appConfigKeyValue": "{{UserPrincipalName}}"
    }
  ],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/assignments",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/deviceStatuses",
  "deviceStatusSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/deviceStatusSummary/$ref",
  "deviceStatusSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/deviceStatusSummary",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/userStatuses",
  "userStatusSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/userStatusSummary/$ref",
  "userStatusSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.iosMobileAppConfiguration/userStatusSummary",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('2024a8a3-0d66-4575-a855-4be8d1304db8')/microsoft.graph.managedDeviceMobileAppConfiguration/microsoft.graph.assign"
  },
  "#CustomRefTargetedApps": "Microsoft Edge: AI Browser|!|ee3a6e08-4cb0-418b-9eb8-43f1a8f1e9de|!|#microsoft.graph.iosStoreApp"
}
