{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileAppConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.iosMobileAppConfiguration",
  "@odata.id": "deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')",
  "@odata.editLink": "deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration",
  "id": "7944e687-d69d-4f57-a56b-39b44e8105aa",
  "targetedMobileApps@odata.type": "#Collection(String)",
  "targetedMobileApps": [
    "1e7e7ccb-3ce2-49c8-a686-b19067980063"
  ],
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-24T11:34:46.9174243Z",
  "description": "To differentiate between devices that are managed and unmanaged, a configuration key is required, this ensures that devices receive the correct app protection policy, as unmanaged devices may have stricter controls.\n\nThis policy sets the required configuration key for MDM managed devices, ensuring they receive the managed app protection policy.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T20:51:03.4580706Z",
  "displayName": "iOS - Supervised - Teams - IntuneMAMUPN",
  "version": 2,
  "encodedSettingXml": null,
  "settings@odata.type": "#Collection(microsoft.graph.appConfigurationSettingItem)",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.appConfigurationSettingItem",
      "appConfigKey": "IntuneMAMUPN",
      "appConfigKeyType@odata.type": "#microsoft.graph.mdmAppConfigKeyType",
      "appConfigKeyType": "stringType",
      "appConfigKeyValue": "{{UserPrincipalName}}"
    }
  ],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/assignments",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/deviceStatuses",
  "deviceStatusSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/deviceStatusSummary/$ref",
  "deviceStatusSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/deviceStatusSummary",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/userStatuses",
  "userStatusSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/userStatusSummary/$ref",
  "userStatusSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.iosMobileAppConfiguration/userStatusSummary",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('7944e687-d69d-4f57-a56b-39b44e8105aa')/microsoft.graph.managedDeviceMobileAppConfiguration/microsoft.graph.assign"
  },
  "#CustomRefTargetedApps": "Microsoft Teams|!|1e7e7ccb-3ce2-49c8-a686-b19067980063|!|#microsoft.graph.iosVppApp"
}
