{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileAppConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.iosMobileAppConfiguration",
  "@odata.id": "deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')",
  "@odata.editLink": "deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration",
  "id": "974f6705-0a47-4ad2-a40f-8f60e96cae8e",
  "targetedMobileApps@odata.type": "#Collection(String)",
  "targetedMobileApps": [
    "adfb47d5-1057-4364-9ea9-92d01b724a16"
  ],
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-23T10:47:06.0124573Z",
  "description": "To differentiate between devices that are managed and unmanaged, a configuration key is required, this ensures that devices receive the correct policies across different managment types.\n\nThis policy sets the required configuration key for supervised iOS devices, ensuring that they benefit from the zero touch onboarding into Defender for Endpoint.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T20:53:10.2825732Z",
  "displayName": "iOS - Supervised - Zero touch MDE onboarding",
  "version": 2,
  "encodedSettingXml": null,
  "settings@odata.type": "#Collection(microsoft.graph.appConfigurationSettingItem)",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.appConfigurationSettingItem",
      "appConfigKey": "issupervised",
      "appConfigKeyType@odata.type": "#microsoft.graph.mdmAppConfigKeyType",
      "appConfigKeyType": "stringType",
      "appConfigKeyValue": "{{issupervised}}"
    }
  ],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/assignments",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/deviceStatuses",
  "deviceStatusSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/deviceStatusSummary/$ref",
  "deviceStatusSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/deviceStatusSummary",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/userStatuses",
  "userStatusSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/userStatusSummary/$ref",
  "userStatusSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.iosMobileAppConfiguration/userStatusSummary",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceAppManagement/mobileAppConfigurations('974f6705-0a47-4ad2-a40f-8f60e96cae8e')/microsoft.graph.managedDeviceMobileAppConfiguration/microsoft.graph.assign"
  },
  "#CustomRefTargetedApps": "Microsoft Defender: Security|!|adfb47d5-1057-4364-9ea9-92d01b724a16|!|#microsoft.graph.iosVppApp"
}
