{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "640e4c3e-e98f-4f67-9a98-22bab4d584e8",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-23T13:04:43.7704749Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T13:34:04.6400624Z",
  "displayName": "Supervised iOS Device Compliance Policy",
  "version": 2,
  "passcodeBlockSimple": true,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": 6,
  "passcodeMinutesOfInactivityBeforeLock": 0,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": null,
  "passcodeRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passcodeRequiredType": "numeric",
  "passcodeRequired": true,
  "osMinimumVersion": "18.0",
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps@odata.type": "#Collection(microsoft.graph.appListItem)",
  "restrictedApps": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')",
      "id": "640e4c3e-e98f-4f67-9a98-22bab4d584e8",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations('8a83d93d-4e45-4bec-8384-c3e46dd84a28')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations('8a83d93d-4e45-4bec-8384-c3e46dd84a28')",
          "id": "8a83d93d-4e45-4bec-8384-c3e46dd84a28",
          "gracePeriodHours": 48,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations('f36749e9-6818-4f45-8403-7ac8fde7b8e0')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations('f36749e9-6818-4f45-8403-7ac8fde7b8e0')",
          "id": "f36749e9-6818-4f45-8403-7ac8fde7b8e0",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "pushNotification",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations('6b8b6416-703e-45a1-9162-801ef5127aca')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionsForRule('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/scheduledActionConfigurations('6b8b6416-703e-45a1-9162-801ef5127aca')",
          "id": "6b8b6416-703e-45a1-9162-801ef5127aca",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "notification",
          "notificationTemplateId": "f3d99c12-ee85-415f-be0e-89e331f76889",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.iosCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('640e4c3e-e98f-4f67-9a98-22bab4d584e8')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
