{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "00b23ffb-8961-485c-85ed-e3a814ce7ba6",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-20T16:40:43.2285421Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T13:33:22.7314051Z",
  "displayName": "Unsupervised iOS Device Compliance Policy",
  "version": 8,
  "passcodeBlockSimple": true,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": 6,
  "passcodeMinutesOfInactivityBeforeLock": 0,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": null,
  "passcodeRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passcodeRequiredType": "numeric",
  "passcodeRequired": true,
  "osMinimumVersion": "18.0",
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps@odata.type": "#Collection(microsoft.graph.appListItem)",
  "restrictedApps": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')",
      "id": "00b23ffb-8961-485c-85ed-e3a814ce7ba6",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations('29f2589c-888d-4813-8ee0-1325572ffb29')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations('29f2589c-888d-4813-8ee0-1325572ffb29')",
          "id": "29f2589c-888d-4813-8ee0-1325572ffb29",
          "gracePeriodHours": 48,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations('905e0a2d-8619-4ee0-9457-da3e1cc983c2')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations('905e0a2d-8619-4ee0-9457-da3e1cc983c2')",
          "id": "905e0a2d-8619-4ee0-9457-da3e1cc983c2",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "pushNotification",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations('99c08dac-7799-4b49-a6a2-4307301b6850')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionsForRule('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/scheduledActionConfigurations('99c08dac-7799-4b49-a6a2-4307301b6850')",
          "id": "99c08dac-7799-4b49-a6a2-4307301b6850",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "notification",
          "notificationTemplateId": "f3d99c12-ee85-415f-be0e-89e331f76889",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.iosCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('00b23ffb-8961-485c-85ed-e3a814ce7ba6')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
