{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')",
  "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2023-08-21T13:41:44.8120578Z",
  "creationSource": null,
  "description": "This profile will ensure OneDrive opens at logins, set's files to use the on-demand feature, hides the dock icon and configures folder redirection.",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2023-08-21T14:23:45.8997949Z",
  "name": "macOS - Preferences - OneDrive Settings ",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 10,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "d9981bda-f674-41bb-9100-f3f5dd8f72db",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/assignments",
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptin",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "%OrganizationId%"
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('0')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('1')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('1')",
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_disabletutorial",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_disabletutorial_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('1')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('1')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('2')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('2')",
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptinwithnotification",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmsilentoptinwithnotification_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('2')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('2')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('3')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('3')",
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_filesondemandenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_filesondemandenabled_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('3')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('3')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('4')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('4')",
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmblockoptout",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmblockoptout_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('4')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('4')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('5')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('5')",
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_hidedockicon",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_hidedockicon_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('5')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('5')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('6')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('6')",
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptindesktop",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmsilentoptindesktop_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('6')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('6')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('7')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('7')",
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmsilentoptindocuments",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_kfmsilentoptindocuments_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('7')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('7')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('8')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('8')",
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_openatlogin",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_openatlogin_true",
          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
          "children": []
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('8')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('8')/settingDefinitions"
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('9')",
      "@odata.editLink": "deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('9')",
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_kfmoptinwithwizard",
        "settingInstanceTemplateReference": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "%OrganizationId%"
        }
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('9')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/settings('9')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/microsoft.graph.assign"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('d9981bda-f674-41bb-9100-f3f5dd8f72db')/microsoft.graph.reorder"
  },
  "assignments": [
    {
      "id": "d9981bda-f674-41bb-9100-f3f5dd8f72db_2390de52-419b-40da-b0e5-d30a006cac6c",
      "source": "direct",
      "sourceId": "d9981bda-f674-41bb-9100-f3f5dd8f72db",
      "target": {
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": null,
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "2390de52-419b-40da-b0e5-d30a006cac6c"
      }
    },
    {
      "id": "d9981bda-f674-41bb-9100-f3f5dd8f72db_adadadad-808e-44e2-905a-0b7873a8a531",
      "source": "direct",
      "sourceId": "d9981bda-f674-41bb-9100-f3f5dd8f72db",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": "1d14518c-3fa7-462a-98eb-6a889835354b",
        "deviceAndAppManagementAssignmentFilterType": "include"
      }
    }
  ]
}
