"{ \"settings\": [\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('aac1866b-fd37-499b-b4e5-4bf6328eda08')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('aac1866b-fd37-499b-b4e5-4bf6328eda08')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"aac1866b-fd37-499b-b4e5-4bf6328eda08\",\r\n    \"definitionId\": \"deviceConfiguration--macOSEndpointProtectionConfiguration_firewallEnabled\",\r\n    \"valueJson\": \"true\",\r\n    \"value\": true\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('89116d80-6a7c-4079-9013-6a135cd2f39e')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('89116d80-6a7c-4079-9013-6a135cd2f39e')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"89116d80-6a7c-4079-9013-6a135cd2f39e\",\r\n    \"definitionId\": \"deviceConfiguration--macOSEndpointProtectionConfiguration_firewallEnableStealthMode\",\r\n    \"valueJson\": \"true\",\r\n    \"value\": true\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementCollectionSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('462f5baf-7d2d-490a-9050-70e3ce9ee0cd')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('462f5baf-7d2d-490a-9050-70e3ce9ee0cd')/microsoft.graph.deviceManagementCollectionSettingInstance\",\r\n    \"id\": \"462f5baf-7d2d-490a-9050-70e3ce9ee0cd\",\r\n    \"definitionId\": \"deviceConfiguration--macOSEndpointProtectionConfiguration_firewallApplications\",\r\n    \"valueJson\": \"null\",\r\n    \"value@odata.associationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('462f5baf-7d2d-490a-9050-70e3ce9ee0cd')/microsoft.graph.deviceManagementCollectionSettingInstance/value/$ref\",\r\n    \"value@odata.navigationLink\": \"https://graph.microsoft.com/beta/deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('462f5baf-7d2d-490a-9050-70e3ce9ee0cd')/microsoft.graph.deviceManagementCollectionSettingInstance/value\"\r\n  },\r\n  {\r\n    \"@odata.type\": \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"@odata.id\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('9e9a63b8-2325-48ce-9df6-9af0631031b4')\",\r\n    \"@odata.editLink\": \"deviceManagement/intents('10d13a10-b59d-4483-bf2f-4792616139ec')/settings('9e9a63b8-2325-48ce-9df6-9af0631031b4')/microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n    \"id\": \"9e9a63b8-2325-48ce-9df6-9af0631031b4\",\r\n    \"definitionId\": \"deviceConfiguration--macOSEndpointProtectionConfiguration_firewallBlockAllIncoming\",\r\n    \"valueJson\": \"false\",\r\n    \"value\": false\r\n  }\r\n]\n}"
