{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.macOSDeviceFeaturesConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration",
  "id": "17e05f20-cfdf-44da-9e6d-b92f631f45e4",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2023-08-14T10:17:13.066898Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2023-08-14T10:17:13.066898Z",
  "description": null,
  "displayName": "macOS - Microsoft Enterprise SSO plug-in",
  "version": 1,
  "adminShowHostInfo": false,
  "loginWindowText": null,
  "authorizedUsersListHidden": false,
  "authorizedUsersListHideLocalUsers": false,
  "authorizedUsersListHideMobileAccounts": false,
  "authorizedUsersListIncludeNetworkUsers": false,
  "authorizedUsersListHideAdminUsers": false,
  "authorizedUsersListShowOtherManagedUsers": false,
  "shutDownDisabled": false,
  "restartDisabled": false,
  "sleepDisabled": false,
  "consoleAccessDisabled": false,
  "shutDownDisabledWhileLoggedIn": false,
  "restartDisabledWhileLoggedIn": false,
  "powerOffDisabledWhileLoggedIn": false,
  "logOutDisabledWhileLoggedIn": false,
  "screenLockDisableImmediate": false,
  "singleSignOnExtension": null,
  "contentCachingEnabled": false,
  "contentCachingType@odata.type": "#microsoft.graph.macOSContentCachingType",
  "contentCachingType": "notConfigured",
  "contentCachingMaxSizeBytes": null,
  "contentCachingDataPath": null,
  "contentCachingDisableConnectionSharing": false,
  "contentCachingForceConnectionSharing": false,
  "contentCachingClientPolicy@odata.type": "#microsoft.graph.macOSContentCachingClientPolicy",
  "contentCachingClientPolicy": "notConfigured",
  "contentCachingPeerPolicy@odata.type": "#microsoft.graph.macOSContentCachingPeerPolicy",
  "contentCachingPeerPolicy": "notConfigured",
  "contentCachingParentSelectionPolicy@odata.type": "#microsoft.graph.macOSContentCachingParentSelectionPolicy",
  "contentCachingParentSelectionPolicy": "notConfigured",
  "contentCachingParents@odata.type": "#Collection(String)",
  "contentCachingParents": [],
  "contentCachingLogClientIdentities": false,
  "contentCachingBlockDeletion": false,
  "contentCachingShowAlerts": false,
  "contentCachingKeepAwake": false,
  "contentCachingPort": null,
  "airPrintDestinations@odata.type": "#Collection(microsoft.graph.airPrintDestination)",
  "airPrintDestinations": [],
  "autoLaunchItems@odata.type": "#Collection(microsoft.graph.macOSLaunchItem)",
  "autoLaunchItems": [],
  "associatedDomains@odata.type": "#Collection(microsoft.graph.keyValuePair)",
  "associatedDomains": [],
  "appAssociatedDomains@odata.type": "#Collection(microsoft.graph.macOSAssociatedDomainsItem)",
  "appAssociatedDomains": [],
  "macOSSingleSignOnExtension": {
    "@odata.type": "#microsoft.graph.macOSAzureAdSingleSignOnExtension",
    "enableSharedDeviceMode": false,
    "bundleIdAccessControlList@odata.type": "#Collection(String)",
    "bundleIdAccessControlList": [],
    "configurations@odata.type": "#Collection(microsoft.graph.keyTypedValuePair)",
    "configurations": [
      {
        "@odata.type": "#microsoft.graph.keyStringValuePair",
        "key": "AppPrefixAllowList",
        "value": "com.microsoft.,com.apple."
      },
      {
        "@odata.type": "#microsoft.graph.keyIntegerValuePair",
        "key": "browser_sso_interaction_enabled",
        "value": 1
      },
      {
        "@odata.type": "#microsoft.graph.keyIntegerValuePair",
        "key": "disable_explicit_app_prompt",
        "value": 1
      }
    ]
  },
  "contentCachingClientListenRanges@odata.type": "#Collection(microsoft.graph.ipRange)",
  "contentCachingClientListenRanges": [],
  "contentCachingPeerListenRanges@odata.type": "#Collection(microsoft.graph.ipRange)",
  "contentCachingPeerListenRanges": [],
  "contentCachingPeerFilterRanges@odata.type": "#Collection(microsoft.graph.ipRange)",
  "contentCachingPeerFilterRanges": [],
  "contentCachingPublicRanges@odata.type": "#Collection(microsoft.graph.ipRange)",
  "contentCachingPublicRanges": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/assignments",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/userStatusOverview",
  "singleSignOnExtensionPkinitCertificate@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/singleSignOnExtensionPkinitCertificate/$ref",
  "singleSignOnExtensionPkinitCertificate@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.macOSDeviceFeaturesConfiguration/singleSignOnExtensionPkinitCertificate",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('17e05f20-cfdf-44da-9e6d-b92f631f45e4')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
