{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.macOSCustomConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration",
  "id": "28bf726f-4860-4f4d-809b-0492ac10436d",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2023-08-15T11:18:17.6411127Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2023-08-15T11:18:17.6411127Z",
  "description": null,
  "displayName": "macOS - Notification Settings - Suppress Notifications for all apps",
  "version": 1,
  "payloadName": "Background Items Notifications.mobileconfig",
  "payloadFileName": "Background Items Notifications.mobileconfig",
  "payload@odata.type": "#Binary",
  "payload": "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5Ob3RpZmljYXRpb25TZXR0aW5nczwva2V5PgoJCQk8YXJyYXk+CgkJCQk8ZGljdD4KCQkJCQk8a2V5PkFsZXJ0VHlwZTwva2V5PgoJCQkJCTxpbnRlZ2VyPjA8L2ludGVnZXI+CgkJCQkJPGtleT5CYWRnZXNFbmFibGVkPC9rZXk+CgkJCQkJPGZhbHNlLz4KCQkJCQk8a2V5PkJ1bmRsZUlkZW50aWZpZXI8L2tleT4KCQkJCQk8c3RyaW5nPmNvbS5hcHBsZS5idG1ub3RpZmljYXRpb25hZ2VudDwvc3RyaW5nPgoJCQkJCTxrZXk+Q3JpdGljYWxBbGVydEVuYWJsZWQ8L2tleT4KCQkJCQk8ZmFsc2UvPgoJCQkJCTxrZXk+Tm90aWZpY2F0aW9uc0VuYWJsZWQ8L2tleT4KCQkJCQk8ZmFsc2UvPgoJCQkJCTxrZXk+UHJldmlld1R5cGU8L2tleT4KCQkJCQk8aW50ZWdlcj4yPC9pbnRlZ2VyPgoJCQkJCTxrZXk+U2hvd0luQ2FyUGxheTwva2V5PgoJCQkJCTxmYWxzZS8+CgkJCQkJPGtleT5TaG93SW5Mb2NrU2NyZWVuPC9rZXk+CgkJCQkJPGZhbHNlLz4KCQkJCQk8a2V5PlNob3dJbk5vdGlmaWNhdGlvbkNlbnRlcjwva2V5PgoJCQkJCTxmYWxzZS8+CgkJCQkJPGtleT5Tb3VuZHNFbmFibGVkPC9rZXk+CgkJCQkJPGZhbHNlLz4KCQkJCTwvZGljdD4KCQkJPC9hcnJheT4KCQkJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCQkJPHN0cmluZz5Ob3RpZmljYXRpb25zPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCQkJPHN0cmluZz5jb20uYXBwbGUubm90aWZpY2F0aW9uc2V0dGluZ3MuQjI4RDM4NjQtODlFMy00MEQyLTgzRUQtMjNCQUY4Njg2M0Q5PC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCQkJPHN0cmluZz5jb20uYXBwbGUubm90aWZpY2F0aW9uc2V0dGluZ3M8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJCQk8c3RyaW5nPkIyOEQzODY0LTg5RTMtNDBEMi04M0VELTIzQkFGODY4NjNEOTwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CgkJCTxpbnRlZ2VyPjE8L2ludGVnZXI+CgkJPC9kaWN0PgoJPC9hcnJheT4KCTxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+Cgk8c3RyaW5nPkJhY2tncm91bmQgSXRlbXMgTm90aWZpY2F0aW9uczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJPHN0cmluZz5jb20uZ2l0aHViLmVyaWtiZXJnbHVuZC5Qcm9maWxlQ3JlYXRvci4wNkY4MEQzMy1BREQ4LTQ0MkMtODEyQy1GQzkyRTkwREM0QTU8L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5BaXIgSVQ8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+Cgk8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVHlwZTwva2V5PgoJPHN0cmluZz5Db25maWd1cmF0aW9uPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRVVUlEPC9rZXk+Cgk8c3RyaW5nPjZGQzVFNjUyLTk2QzQtNEMwNy04ODg2LTc4MjU4MTgxN0Q3ODwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJPGludGVnZXI+MTwvaW50ZWdlcj4KPC9kaWN0Pgo8L3BsaXN0Pgo=",
  "deploymentChannel@odata.type": "#microsoft.graph.appleDeploymentChannel",
  "deploymentChannel": "deviceChannel",
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/assignments",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.macOSCustomConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('28bf726f-4860-4f4d-809b-0492ac10436d')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
