{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections(assignments(),apps())/$entity",
  "@odata.type": "#microsoft.graph.androidManagedAppProtection",
  "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')",
  "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')",
  "displayName": "Android - Managed app protection policy",
  "description": "",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-21T14:28:36.6039291Z",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-21T14:29:25Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "T_6f2259c8-554e-4c63-aba4-3b78e78d4798",
  "version": "\"70005d31-0000-0c00-0000-678faf450000\"",
  "periodOfflineBeforeAccessCheck@odata.type": "#Duration",
  "periodOfflineBeforeAccessCheck": "P1D",
  "periodOnlineBeforeAccessCheck@odata.type": "#Duration",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "allowedInboundDataTransferSources@odata.type": "#microsoft.graph.managedAppDataTransferLevel",
  "allowedInboundDataTransferSources": "allApps",
  "allowedOutboundDataTransferDestinations@odata.type": "#microsoft.graph.managedAppDataTransferLevel",
  "allowedOutboundDataTransferDestinations": "managedApps",
  "organizationalCredentialsRequired": false,
  "allowedOutboundClipboardSharingLevel@odata.type": "#microsoft.graph.managedAppClipboardSharingLevel",
  "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
  "dataBackupBlocked": true,
  "deviceComplianceRequired": true,
  "managedBrowserToOpenLinksRequired": true,
  "saveAsBlocked": true,
  "periodOfflineBeforeWipeIsEnforced@odata.type": "#Duration",
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "pinRequired": true,
  "maximumPinRetries": 5,
  "simplePinBlocked": true,
  "minimumPinLength": 8,
  "pinCharacterSet@odata.type": "#microsoft.graph.managedAppPinCharacterSet",
  "pinCharacterSet": "numeric",
  "periodBeforePinReset@odata.type": "#Duration",
  "periodBeforePinReset": "PT0S",
  "allowedDataStorageLocations@odata.type": "#Collection(microsoft.graph.managedAppDataStorageLocation)",
  "allowedDataStorageLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "photoLibrary"
  ],
  "contactSyncBlocked": false,
  "printBlocked": false,
  "fingerprintBlocked": false,
  "disableAppPinIfDevicePinIsSet": true,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumRequiredOsVersion": "12.0",
  "minimumWarningOsVersion": "13.0",
  "minimumRequiredAppVersion": null,
  "minimumWarningAppVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipeAppVersion": null,
  "appActionIfDeviceComplianceRequired@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfMaximumPinRetriesExceeded@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "pinRequiredInsteadOfBiometricTimeout@odata.type": "#Duration",
  "pinRequiredInsteadOfBiometricTimeout": "PT30M",
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "notificationRestriction@odata.type": "#microsoft.graph.managedAppNotificationRestriction",
  "notificationRestriction": "allow",
  "previousPinBlockCount": 0,
  "managedBrowser@odata.type": "#microsoft.graph.managedBrowserType",
  "managedBrowser": "microsoftEdge",
  "maximumAllowedDeviceThreatLevel@odata.type": "#microsoft.graph.managedAppDeviceThreatLevel",
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "mobileThreatDefenseRemediationAction@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "mobileThreatDefenseRemediationAction": "block",
  "mobileThreatDefensePartnerPriority": null,
  "blockDataIngestionIntoOrganizationDocuments": false,
  "allowedDataIngestionLocations@odata.type": "#Collection(microsoft.graph.managedAppDataIngestionLocation)",
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera",
    "photoLibrary"
  ],
  "appActionIfUnableToAuthenticateUser@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfUnableToAuthenticateUser": "block",
  "dialerRestrictionLevel@odata.type": "#microsoft.graph.managedAppPhoneNumberRedirectLevel",
  "dialerRestrictionLevel": "allApps",
  "gracePeriodToBlockAppsDuringOffClockHours": null,
  "protectedMessagingRedirectAppType@odata.type": "#microsoft.graph.messagingRedirectAppType",
  "protectedMessagingRedirectAppType": "anyApp",
  "isAssigned": true,
  "targetedAppManagementLevels@odata.type": "#microsoft.graph.appManagementLevel",
  "targetedAppManagementLevels": "unspecified",
  "appGroupType@odata.type": "#microsoft.graph.targetedManagedAppGroupType",
  "appGroupType": "allMicrosoftApps",
  "screenCaptureBlocked": false,
  "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
  "encryptAppData": true,
  "deployedAppCount": 44,
  "minimumRequiredPatchVersion": null,
  "minimumWarningPatchVersion": null,
  "minimumWipePatchVersion": null,
  "allowedAndroidDeviceManufacturers": null,
  "appActionIfAndroidDeviceManufacturerNotAllowed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
  "appActionIfAccountIsClockedOut": null,
  "appActionIfSamsungKnoxAttestationRequired": null,
  "requiredAndroidSafetyNetDeviceAttestationType@odata.type": "#microsoft.graph.androidManagedAppSafetyNetDeviceAttestationType",
  "requiredAndroidSafetyNetDeviceAttestationType": "basicIntegrity",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
  "requiredAndroidSafetyNetAppsVerificationType@odata.type": "#microsoft.graph.androidManagedAppSafetyNetAppsVerificationType",
  "requiredAndroidSafetyNetAppsVerificationType": "enabled",
  "appActionIfAndroidSafetyNetAppsVerificationFailed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
  "customBrowserPackageId": "",
  "customBrowserDisplayName": "",
  "minimumRequiredCompanyPortalVersion": null,
  "minimumWarningCompanyPortalVersion": null,
  "minimumWipeCompanyPortalVersion": null,
  "keyboardsRestricted": false,
  "allowedAndroidDeviceModels@odata.type": "#Collection(String)",
  "allowedAndroidDeviceModels": [],
  "appActionIfAndroidDeviceModelNotAllowed@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfAndroidDeviceModelNotAllowed": "block",
  "customDialerAppPackageId": "",
  "customDialerAppDisplayName": "",
  "biometricAuthenticationBlocked": false,
  "requiredAndroidSafetyNetEvaluationType@odata.type": "#microsoft.graph.androidManagedAppSafetyNetEvaluationType",
  "requiredAndroidSafetyNetEvaluationType": "basic",
  "blockAfterCompanyPortalUpdateDeferralInDays": 0,
  "warnAfterCompanyPortalUpdateDeferralInDays": 0,
  "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
  "deviceLockRequired": false,
  "appActionIfDeviceLockNotSet@odata.type": "#microsoft.graph.managedAppRemediationAction",
  "appActionIfDeviceLockNotSet": "block",
  "connectToVpnOnLaunch": false,
  "appActionIfDevicePasscodeComplexityLessThanLow": null,
  "appActionIfDevicePasscodeComplexityLessThanMedium": null,
  "appActionIfDevicePasscodeComplexityLessThanHigh": null,
  "requireClass3Biometrics": true,
  "requirePinAfterBiometricChange": true,
  "fingerprintAndBiometricEnabled": true,
  "messagingRedirectAppPackageId": "",
  "messagingRedirectAppDisplayName": "",
  "exemptedAppPackages@odata.type": "#Collection(microsoft.graph.keyValuePair)",
  "exemptedAppPackages": [],
  "approvedKeyboards@odata.type": "#Collection(microsoft.graph.keyValuePair)",
  "approvedKeyboards": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/assignments",
  "apps@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps",
  "apps@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps/$ref",
  "apps@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps",
  "apps": [
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.azure.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.azure.android')",
      "id": "com.microsoft.azure.android",
      "version": "-986385631",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.azure"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.copilot.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.copilot.android')",
      "id": "com.microsoft.copilot.android",
      "version": "-1816841598",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.copilot"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.cortana.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.cortana.android')",
      "id": "com.microsoft.cortana.android",
      "version": "1239242880",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.cortana"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmphone.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmphone.android')",
      "id": "com.microsoft.crm.crmphone.android",
      "version": "-1708416158",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.crm.crmphone"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmphone.fieldservices.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmphone.fieldservices.android')",
      "id": "com.microsoft.crm.crmphone.fieldservices.android",
      "version": "-2050426900",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.crm.crmphone.fieldservices"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmphone.sales.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmphone.sales.android')",
      "id": "com.microsoft.crm.crmphone.sales.android",
      "version": "-2031984416",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.crm.crmphone.sales"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmtablet.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.crm.crmtablet.android')",
      "id": "com.microsoft.crm.crmtablet.android",
      "version": "1872338160",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.crm.crmtablet"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.designer.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.designer.android')",
      "id": "com.microsoft.designer.android",
      "version": "-1999652223",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.designer"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.dynamics.invoice.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.dynamics.invoice.android')",
      "id": "com.microsoft.dynamics.invoice.android",
      "version": "1413520457",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.dynamics.invoice"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.emmx.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.emmx.android')",
      "id": "com.microsoft.emmx.android",
      "version": "-725393251",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.emmx"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.flow.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.flow.android')",
      "id": "com.microsoft.flow.android",
      "version": "-496779816",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.flow"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.ipviewer.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.ipviewer.android')",
      "id": "com.microsoft.ipviewer.android",
      "version": "522412547",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.ipviewer"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.launcher.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.launcher.android')",
      "id": "com.microsoft.launcher.android",
      "version": "-1429615568",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.launcher"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.lists.public.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.lists.public.android')",
      "id": "com.microsoft.lists.public.android",
      "version": "58058220",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.lists.public"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.loop.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.loop.android')",
      "id": "com.microsoft.loop.android",
      "version": "1110081234",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.loop"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.mobile.polymer.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.mobile.polymer.android')",
      "id": "com.microsoft.mobile.polymer.android",
      "version": "2129189606",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.mobile.polymer"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.msapps.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.msapps.android')",
      "id": "com.microsoft.msapps.android",
      "version": "986978680",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.msapps"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.o365smb.connections.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.o365smb.connections.android')",
      "id": "com.microsoft.o365smb.connections.android",
      "version": "1379963506",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.o365smb.connections"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.excel.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.excel.android')",
      "id": "com.microsoft.office.excel.android",
      "version": "-1789826587",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.excel"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.lync15.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.lync15.android')",
      "id": "com.microsoft.office.lync15.android",
      "version": "-1419864878",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.lync15"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officehub.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officehub.android')",
      "id": "com.microsoft.office.officehub.android",
      "version": "-1091809935",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.officehub"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officehubhl.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officehubhl.android')",
      "id": "com.microsoft.office.officehubhl.android",
      "version": "-1175805259",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.officehubhl"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officehubrow.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officehubrow.android')",
      "id": "com.microsoft.office.officehubrow.android",
      "version": "-1861979965",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.officehubrow"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officelens.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.officelens.android')",
      "id": "com.microsoft.office.officelens.android",
      "version": "-641720584",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.officelens"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.onenote.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.onenote.android')",
      "id": "com.microsoft.office.onenote.android",
      "version": "186482170",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.onenote"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.outlook.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.outlook.android')",
      "id": "com.microsoft.office.outlook.android",
      "version": "1146701235",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.outlook"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.powerpoint.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.powerpoint.android')",
      "id": "com.microsoft.office.powerpoint.android",
      "version": "1411665537",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.powerpoint"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.word.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.office.word.android')",
      "id": "com.microsoft.office.word.android",
      "version": "2122351424",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.office.word"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.outlookgroups.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.outlookgroups.android')",
      "id": "com.microsoft.outlookgroups.android",
      "version": "-1510063479",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.outlookgroups"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.planner.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.planner.android')",
      "id": "com.microsoft.planner.android",
      "version": "-1658524342",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.planner"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.powerbim.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.powerbim.android')",
      "id": "com.microsoft.powerbim.android",
      "version": "1564653697",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.powerbim"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.ramobile.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.ramobile.android')",
      "id": "com.microsoft.ramobile.android",
      "version": "359972835",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.ramobile"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.rdc.android.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.rdc.android.android')",
      "id": "com.microsoft.rdc.android.android",
      "version": "-358360192",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.rdc.android"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.rdc.androidx.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.rdc.androidx.android')",
      "id": "com.microsoft.rdc.androidx.android",
      "version": "1849989238",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.rdc.androidx"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.scmx.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.scmx.android')",
      "id": "com.microsoft.scmx.android",
      "version": "1440552745",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.scmx"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.sharepoint.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.sharepoint.android')",
      "id": "com.microsoft.sharepoint.android",
      "version": "84773357",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.sharepoint"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.skydrive.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.skydrive.android')",
      "id": "com.microsoft.skydrive.android",
      "version": "1887770705",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.skydrive"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.teams.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.teams.android')",
      "id": "com.microsoft.teams.android",
      "version": "1900143244",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.teams"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.todos.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.todos.android')",
      "id": "com.microsoft.todos.android",
      "version": "1697858135",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.todos"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.whiteboard.publicpreview.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.whiteboard.publicpreview.android')",
      "id": "com.microsoft.whiteboard.publicpreview.android",
      "version": "-405842818",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.whiteboard.publicpreview"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.workfolders.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.microsoft.workfolders.android')",
      "id": "com.microsoft.workfolders.android",
      "version": "-1290240016",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.microsoft.workfolders"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.ms.office365admin.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.ms.office365admin.android')",
      "id": "com.ms.office365admin.android",
      "version": "1040477753",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.ms.office365admin"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.yammer.v1.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('com.yammer.v1.android')",
      "id": "com.yammer.v1.android",
      "version": "-1248070370",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "com.yammer.v1"
      }
    },
    {
      "@odata.type": "#microsoft.graph.managedMobileApp",
      "@odata.id": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('ols.microsoft.com.shiftr.android')",
      "@odata.editLink": "deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/apps('ols.microsoft.com.shiftr.android')",
      "id": "ols.microsoft.com.shiftr.android",
      "version": "1462285532",
      "mobileAppIdentifier": {
        "@odata.type": "#microsoft.graph.androidMobileAppIdentifier",
        "packageId": "ols.microsoft.com.shiftr"
      }
    }
  ],
  "deploymentSummary@odata.associationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/deploymentSummary/$ref",
  "deploymentSummary@odata.navigationLink": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/deploymentSummary",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/microsoft.graph.targetedManagedAppProtection/microsoft.graph.assign"
  },
  "#microsoft.graph.targetApps": [
    {
      "title": "microsoft.graph.targetApps",
      "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/microsoft.graph.targetedManagedAppProtection/microsoft.graph.targetApps"
    },
    {
      "title": "microsoft.graph.targetApps",
      "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/microsoft.graph.managedAppPolicy/microsoft.graph.targetApps"
    },
    {
      "title": "microsoft.graph.targetApps",
      "target": "https://graph.microsoft.com/beta/deviceAppManagement/androidManagedAppProtections('T_6f2259c8-554e-4c63-aba4-3b78e78d4798')/microsoft.graph.managedAppProtection/microsoft.graph.targetApps"
    }
  ]
}
