{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-23T13:02:20.8421824Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T13:35:35.7112156Z",
  "displayName": "Corporate Android Device Compliance Policy",
  "version": 3,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": null,
  "osMinimumVersion": "12",
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": null,
  "passwordRequired": true,
  "passwordMinimumLength": 8,
  "passwordMinimumLetterCharacters": null,
  "passwordMinimumLowerCaseCharacters": null,
  "passwordMinimumNonLetterCharacters": null,
  "passwordMinimumNumericCharacters": null,
  "passwordMinimumSymbolCharacters": null,
  "passwordMinimumUpperCaseCharacters": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidDeviceOwnerRequiredPasswordType",
  "passwordRequiredType": "numericComplex",
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordPreviousPasswordCountToBlock": null,
  "storageRequireEncryption": true,
  "securityRequireIntuneAppIntegrity": null,
  "requireNoPendingSystemUpdates": null,
  "securityRequiredAndroidSafetyNetEvaluationType@odata.type": "#microsoft.graph.androidSafetyNetEvaluationType",
  "securityRequiredAndroidSafetyNetEvaluationType": "basic",
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')",
      "id": "3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations('d9237234-4796-4082-95c5-51d929a62a06')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations('d9237234-4796-4082-95c5-51d929a62a06')",
          "id": "d9237234-4796-4082-95c5-51d929a62a06",
          "gracePeriodHours": 48,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations('0a3bc0d2-a57a-48e0-9cb3-5dafa27b0974')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations('0a3bc0d2-a57a-48e0-9cb3-5dafa27b0974')",
          "id": "0a3bc0d2-a57a-48e0-9cb3-5dafa27b0974",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "pushNotification",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations('790cb742-e329-42e5-bad0-84a6bcc36171')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionsForRule('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/scheduledActionConfigurations('790cb742-e329-42e5-bad0-84a6bcc36171')",
          "id": "790cb742-e329-42e5-bad0-84a6bcc36171",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "notification",
          "notificationTemplateId": "5ddbeb36-2996-4482-9d8a-efe91041e65f",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('3ef2bccb-d7c3-4760-a4ca-ff5d5ab69761')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
