{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "b71465fd-5223-407d-9b21-a4211c1b73eb",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-20T15:57:34.7112982Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-26T13:35:52.1910346Z",
  "displayName": "Personal Android Device Compliance Policy",
  "version": 7,
  "passwordRequired": true,
  "passwordMinimumLength": 8,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidRequiredPasswordType",
  "passwordRequiredType": "numericComplex",
  "requiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "requiredPasswordComplexity": "high",
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "workProfilePasswordExpirationInDays": null,
  "workProfilePasswordMinimumLength": null,
  "workProfileInactiveBeforeScreenLockInMinutes": null,
  "workProfilePreviousPasswordBlockCount": null,
  "workProfilePasswordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "workProfilePasswordRequiredType": "deviceDefault",
  "workProfileRequiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "workProfileRequiredPasswordComplexity": "none",
  "workProfileRequirePassword": false,
  "securityPreventInstallAppsFromUnknownSources": false,
  "securityDisableUsbDebugging": false,
  "securityRequireVerifyApps": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": "12",
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": null,
  "storageRequireEncryption": false,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": false,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": false,
  "securityRequireCompanyPortalAppIntegrity": false,
  "securityRequiredAndroidSafetyNetEvaluationType@odata.type": "#microsoft.graph.androidSafetyNetEvaluationType",
  "securityRequiredAndroidSafetyNetEvaluationType": "basic",
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/assignments",
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')",
      "id": "b71465fd-5223-407d-9b21-a4211c1b73eb",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations('658df01c-1ed8-4478-af75-2163635145dc')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations('658df01c-1ed8-4478-af75-2163635145dc')",
          "id": "658df01c-1ed8-4478-af75-2163635145dc",
          "gracePeriodHours": 48,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations('1bc9fef4-4166-4e0e-bb66-ed9ac590811a')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations('1bc9fef4-4166-4e0e-bb66-ed9ac590811a')",
          "id": "1bc9fef4-4166-4e0e-bb66-ed9ac590811a",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "pushNotification",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        },
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations('d83d158e-6158-445d-ab7c-bd5cc3955be2')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionsForRule('b71465fd-5223-407d-9b21-a4211c1b73eb')/scheduledActionConfigurations('d83d158e-6158-445d-ab7c-bd5cc3955be2')",
          "id": "d83d158e-6158-445d-ab7c-bd5cc3955be2",
          "gracePeriodHours": 24,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "notification",
          "notificationTemplateId": "5ddbeb36-2996-4482-9d8a-efe91041e65f",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.androidWorkProfileCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('b71465fd-5223-407d-9b21-a4211c1b73eb')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
