{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')",
  "@odata.editLink": "deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-24T11:53:35.2436768Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-24T11:55:17.3082475Z",
  "name": "iOS - Managed - DDM - Software Updates",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "iOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 1,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "fb579b81-16c7-43bf-9585-3bc5ffced51d",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/assignments",
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "softwareupdate_softwareupdate",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "softwareupdate_automaticactions",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "softwareupdate_automaticactions_download",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "softwareupdate_automaticactions_download_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "softwareupdate_automaticactions_installosupdates",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "softwareupdate_automaticactions_installosupdates_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "softwareupdate_deferrals",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "softwareupdate_deferrals_combinedperiodindays",
                        "settingInstanceTemplateReference": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference": null,
                          "value": 7
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "softwareupdate_notifications",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "softwareupdate_notifications_true",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "softwareupdate_rapidsecurityresponse",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "softwareupdate_rapidsecurityresponse_enable",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "softwareupdate_rapidsecurityresponse_enable_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "softwareupdate_rapidsecurityresponse_enablerollback",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "softwareupdate_rapidsecurityresponse_enablerollback_true",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": []
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "softwareupdate_recommendedcadence",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "softwareupdate_recommendedcadence_2",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/settings('0')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('fb579b81-16c7-43bf-9585-3bc5ffced51d')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
