{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
  "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
  "@odata.id": "deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')",
  "@odata.editLink": "deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-24T11:50:03.9465866Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-24T11:50:03.9465866Z",
  "name": "iOS - Supervised - Microsoft Enterprise SSO",
  "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
  "platforms": "iOS",
  "priorityMetaData": null,
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 1,
  "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
  "technologies": "mdm,appleRemoteManagement",
  "id": "c63889ae-ba50-4932-8ce8-3effc2aec090",
  "templateReference": {
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
    "templateId": "",
    "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/assignments",
  "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings",
  "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings/$ref",
  "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "@odata.id": "deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings('0')",
      "@odata.editLink": "deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings('0')",
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
        "groupSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
            "settingValueTemplateReference": null,
            "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.extensiblesso_extensiondata",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                "groupSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                        "settingInstanceTemplateReference": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "Enable_SSO_On_All_ManagedApps"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_ignored_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": [
                            {
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                              "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_integer",
                              "settingInstanceTemplateReference": null,
                              "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                              }
                            }
                          ]
                        }
                      }
                    ]
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                        "settingInstanceTemplateReference": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "AppAllowList"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_ignored_0",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": [
                            {
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                              "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_string",
                              "settingInstanceTemplateReference": null,
                              "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "com.microsoft.,com.apple."
                              }
                            }
                          ]
                        }
                      }
                    ]
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                        "settingInstanceTemplateReference": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "browser_sso_interaction_enabled"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_ignored_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": [
                            {
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                              "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_integer",
                              "settingInstanceTemplateReference": null,
                              "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                              }
                            }
                          ]
                        }
                      }
                    ]
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                    "settingValueTemplateReference": null,
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                        "settingInstanceTemplateReference": null,
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "disable_explicit_app_prompt"
                        }
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "com.apple.extensiblesso_ignored_1",
                          "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                          "children": [
                            {
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                              "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_integer",
                              "settingInstanceTemplateReference": null,
                              "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                              }
                            }
                          ]
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_extensionidentifier",
                "settingInstanceTemplateReference": null,
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.microsoft.azureauthenticator.ssoextension"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_screenlockedbehavior",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.extensiblesso_screenlockedbehavior_0",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.extensiblesso_type",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "com.apple.extensiblesso_type_1",
                  "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                "settingDefinitionId": "com.apple.extensiblesso_urls",
                "settingInstanceTemplateReference": null,
                "simpleSettingCollectionValue@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                "simpleSettingCollectionValue": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.microsoftonline.com"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.microsoft.com"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://sts.windows.net"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login.microsoftonline.us"
                  },
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "https://login-us.microsoftonline.com"
                  }
                ]
              }
            ]
          }
        ]
      },
      "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings('0')/settingDefinitions/$ref",
      "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/settings('0')/settingDefinitions"
    }
  ],
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.assign"
  },
  "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.createCopy": {
    "title": "microsoft.graph.createCopy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.createCopy"
  },
  "#microsoft.graph.reorder": {
    "title": "microsoft.graph.reorder",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.reorder"
  },
  "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
    "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
  },
  "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
    "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
    "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies('c63889ae-ba50-4932-8ce8-3effc2aec090')/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
  }
}
