{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
  "id": "ee6ee6e5-810c-4918-9e19-6701606fc3e2",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-24T12:04:58.0428917Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-24T12:04:58.0428917Z",
  "description": null,
  "displayName": "Android - Personally Owned - Prevent App Installations from Unknown Sources",
  "version": 1,
  "passwordBlockFaceUnlock": false,
  "passwordBlockFingerprintUnlock": false,
  "passwordBlockIrisUnlock": false,
  "passwordBlockTrustAgents": false,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinutesOfInactivityBeforeScreenTimeout": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "passwordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "passwordRequiredType": "atLeastNumeric",
  "requiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "requiredPasswordComplexity": "none",
  "workProfileAllowAppInstallsFromUnknownSources": false,
  "workProfileDataSharingType@odata.type": "#microsoft.graph.androidWorkProfileCrossProfileDataSharingType",
  "workProfileDataSharingType": "deviceDefault",
  "workProfileBlockNotificationsWhileDeviceLocked": false,
  "workProfileBlockAddingAccounts": false,
  "workProfileBluetoothEnableContactSharing": false,
  "workProfileBlockScreenCapture": false,
  "workProfileBlockCrossProfileCallerId": false,
  "workProfileBlockCamera": false,
  "workProfileBlockCrossProfileContactsSearch": false,
  "workProfileBlockCrossProfileCopyPaste": true,
  "workProfileDefaultAppPermissionPolicy@odata.type": "#microsoft.graph.androidWorkProfileDefaultAppPermissionPolicyType",
  "workProfileDefaultAppPermissionPolicy": "deviceDefault",
  "workProfilePasswordBlockFaceUnlock": false,
  "workProfilePasswordBlockFingerprintUnlock": false,
  "workProfilePasswordBlockIrisUnlock": false,
  "workProfilePasswordBlockTrustAgents": false,
  "workProfilePasswordExpirationDays": null,
  "workProfilePasswordMinimumLength": null,
  "workProfilePasswordMinNumericCharacters": null,
  "workProfilePasswordMinNonLetterCharacters": null,
  "workProfilePasswordMinLetterCharacters": null,
  "workProfilePasswordMinLowerCaseCharacters": null,
  "workProfilePasswordMinUpperCaseCharacters": null,
  "workProfilePasswordMinSymbolCharacters": null,
  "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout": null,
  "workProfilePasswordPreviousPasswordBlockCount": null,
  "workProfilePasswordSignInFailureCountBeforeFactoryReset": null,
  "workProfilePasswordRequiredType@odata.type": "#microsoft.graph.androidWorkProfileRequiredPasswordType",
  "workProfilePasswordRequiredType": "deviceDefault",
  "workProfileRequiredPasswordComplexity@odata.type": "#microsoft.graph.androidRequiredPasswordComplexity",
  "workProfileRequiredPasswordComplexity": "none",
  "workProfileRequirePassword": false,
  "securityRequireVerifyApps": false,
  "vpnAlwaysOnPackageIdentifier": null,
  "vpnEnableAlwaysOnLockdownMode": false,
  "workProfileAllowWidgets": false,
  "workProfileBlockPersonalAppInstallsFromUnknownSources": true,
  "workProfileAccountUse@odata.type": "#microsoft.graph.androidWorkProfileAccountUse",
  "workProfileAccountUse": "allowAllExceptGoogleAccounts",
  "allowedGoogleAccountDomains@odata.type": "#Collection(String)",
  "allowedGoogleAccountDomains": [],
  "blockUnifiedPasswordForWorkProfile": false,
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('ee6ee6e5-810c-4918-9e19-6701606fc3e2')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
