{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/assignmentFilters/$entity",
  "@odata.type": "#microsoft.graph.deviceAndAppManagementAssignmentFilter",
  "@odata.id": "deviceManagement/assignmentFilters('16622112-00f9-4047-993a-abe8a610afd6')",
  "@odata.editLink": "deviceManagement/assignmentFilters('16622112-00f9-4047-993a-abe8a610afd6')",
  "id": "16622112-00f9-4047-993a-abe8a610afd6",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-01-20T22:08:58.711389Z",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-01-20T22:08:58.711389Z",
  "displayName": "iOS managed devices",
  "description": "",
  "platform@odata.type": "#microsoft.graph.devicePlatformType",
  "platform": "iOSMobileApplicationManagement",
  "rule": "(app.deviceManagementType -eq \"Managed\")",
  "roleScopeTags@odata.type": "#Collection(String)",
  "roleScopeTags": [
    "0"
  ],
  "assignmentFilterManagementType@odata.type": "#microsoft.graph.assignmentFilterManagementType",
  "assignmentFilterManagementType": "apps",
  "payloads@odata.type": "#Collection(microsoft.graph.payloadByFilter)",
  "payloads": [],
  "#microsoft.graph.getSupportedProperties": {
    "title": "microsoft.graph.getSupportedProperties",
    "target": "https://graph.microsoft.com/beta/deviceManagement/assignmentFilters('16622112-00f9-4047-993a-abe8a610afd6')/microsoft.graph.getSupportedProperties"
  }
}
